Gizmodo/Aqua-Controller-based-on-ESP8266/src/Main.cpp
    for (int i = 0; i < LIGHTS_COUNT; ++i) {
        std::string buffer = "Прожектор " + std::to_string(i + 1);
        auto item = lights.at(i);
        item.setName(buffer);
        item.setMediator(medLight);
        lights.at(i) = item;
        auto schedule = schedules.at(index);
        schedule.setDevice(&(lights.at(i)));
        schedules.at(index) = schedule;
        index++;
    }

    // Compressor
    auto schedule = schedules.at(index);
    schedule.setDevice(compressor);
    schedules.at(index) = schedule;
    index++;
    // Flow
    schedule = schedules.at(index);
    schedule.setDevice(flow);
    schedules.at(index) = schedule;
    index++;
    // CO2
    schedule = schedules.at(index);
    schedule.setDevice(co2);
    schedules.at(index) = schedule;
    index++;
    // Dosers
    for (int i = 0; i < DOSERS_COUNT; ++i) {
        auto schedule_ = schedules.at(index);
        schedule_.setDevice(&(dosers.at(i)));
        schedules.at(index) = schedule_;
        index++;
    }

    // Heater
    schedule = schedules.at(index);
    schedule.setDevice(heater);
    schedules.at(index) = schedule;
    index++;
    // Pump
    schedule = schedules.at(index);
    schedule.setDevice(pump);
    schedules.at(index) = schedule;
    index++;
    for (int i = 0; i < SONIC_COUNT; ++i) {
        std::string buffer = "Дальномер " + std::to_string(i + 1);
        auto item = sonics.at(i);
        item.setName(buffer);
        item.setMediator(medSonic);
        sonics.at(i) = item;
        auto scheduleSonic = schedules.at(index);
        scheduleSonic.setDevice(&(sonics.at(i)));
        schedules.at(index) = scheduleSonic;
        index++;
    }
}

void printDevice(Sensor* device) {
    if (device->isDoser()) {
        auto doser = static_cast<Doser*>(device);
        Serial.printf_P(PSTR("%s\n"), doser->DoserInfo().c_str());
    } else if (device->isSonic()) {
        Serial.printf_P(PSTR("%s\n"), device->sonicInfo().c_str());
    } else {
        Serial.printf_P(PSTR("%s\n"), device->sensorInfo().c_str());
    }
}

void printAllDevices() {
    Serial.printf_P(PSTR("\n%s\n"), "Вывод информации об устройствах:");
    for (auto light : lights) {
        printDevice(&light);
    }
    printDevice(compressor);
    printDevice(flow);
    printDevice(co2);

    for (auto doser : dosers) {
        printDevice(&doser);
    }

    printDevice(heater);
    printDevice(pump);

    for (auto sonic : sonics) {
        printDevice((&sonic));
    }
}

float getSensorTemperature(const uint8_t* sensorAddress) {
    unsigned int rawData;
    onewire.reset();
    onewire.select(sensorAddress);
    onewire.write(0x44, 1);
    onewire.reset();
    onewire.select(sensorAddress);
    onewire.write(0xBE);
    for (uint8_t i = 0; i < 9; i++) {
        sensorData[i] = onewire.read();
    }
    rawData = (sensorData[1] << 8) | sensorData[0];
    float celsius = static_cast<float>(rawData) / static_cast<float>(16.0);
    return celsius;
}

void getSensorsTemperature() {
    sensorTemperatureValue1 = getSensorTemperature(sensorTemperatureAddress1);
    sensorTemperatureValue2 = getSensorTemperature(sensorTemperatureAddress2);
    Serial.printf_P(PSTR(" [T1: %s°]  [T2: %s°]\n"), String(sensorTemperatureValue1).c_str(),
                    String(sensorTemperatureValue2).c_str());
}

void sendMessage(const String& message) {
    char* url = getPGMString(urlPushMessage);
    char* aj = getPGMString(applicationJson);
    char* ct = getPGMString(contentType);
    char* att = getPGMString(androidTickerText);
    char* actitle = getPGMString(androidContentTitle);
    char* actext = getPGMString(androidContentText);
    if (https.begin(*client, String(url))) {
        String data;
        data = R"({"message":")" + message + "\"}";
        https.addHeader(String(ct), String(aj));
        https.addHeader(String(att), F("You just got a push notification!"));
        https.addHeader(String(actitle), F("This is a notification title"));
        https.addHeader(String(actext), F("Push Notifications are cool"));

        int httpCode = https.POST(data);
        if ((httpCode > 0) && (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)) {
            Serial.println(F("   PUSH уведомление отправлено"));
        } else {
            Serial.printf_P(PSTR("   sendMessage() -> Ошибка: %s\n"), HTTPClient::errorToString(httpCode).c_str());
        }
        https.end();
    } else {
        Serial.printf_P(PSTR("%s\n"), "   sendMessage() -> Невозможно подключиться\n");
    }
    delPtr(url);
    delPtr(ct);
    delPtr(att);
    delPtr(actitle);
    delPtr(actext);
    delPtr(aj);
}

void sendMessage(Sensor* device, bool state) {
    char dataMsg[100];
    String stateString = state ? "включение" : "выключение";
    char* p = clockRTC.dateFormat("H:i:s", clockRTC.getDateTime());
    sprintf(dataMsg, "%s: %s", device->getName().c_str(), String(p).c_str());
    delPtr(p);

    char* url = getPGMString(urlPushMessage);
    char* aj = getPGMString(applicationJson);
    char* ct = getPGMString(contentType);
    char* att = getPGMString(androidTickerText);
    char* actitle = getPGMString(androidContentTitle);
    char* actext = getPGMString(androidContentText);

    if (https.begin(*client, String(url))) {
        String data;
        data = R"({"message":")" + stateString + "\"}";
        https.addHeader(String(ct), String(aj));
        https.addHeader(String(att), F("You just got a push notification!"));
        https.addHeader(String(actitle), F("This is a notification title"));
        https.addHeader(String(actext), String(dataMsg));
        int httpCode = https.POST(data);
        if ((httpCode > 0) && (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)) {
            Serial.println(F("   PUSH уведомление отправлено"));
        } else {
            Serial.printf_P(PSTR("   sendMessage() -> Ошибка: %s\n"), HTTPClient::errorToString(httpCode).c_str());
        }
        https.end();
    } else {
        Serial.printf_P(PSTR("%s\n"), "   sendMessage() -> Невозможно подключиться\n");
    }
    delPtr(url);
    delPtr(ct);
    delPtr(att);
    delPtr(actitle);
    delPtr(actext);
    delPtr(aj);
    stateString.clear();
}

