Gizmodo/Aqua-Controller-based-on-ESP8266/src/Main.cpp
        schedules.at(i) = schedule;
        (sensor->shouldRun(clockRTC.getDateTime().hour, clockRTC.getDateTime().minute)) ? sensorHandler(sensor, true)
                                                                                        : sensorHandler(sensor, false);
    }
}
void alarmHeater() {
    for (size_t i = 0; i < DEVICE_COUNT; i++) {
        if (!schedules.at(i).getDevice()->isHeater()) {
            continue;
        }
        auto schedule = schedules.at(i);
        auto sensor = schedule.getDevice();
        auto alarm = Alarm.alarmRepeat(sensor->getHourOn(), sensor->getMinuteOn(), sensor->getHourOff(), sensor->getMinuteOff(),
                                       sensorHandler, sensor);
        schedule.setAlarm(alarm);

        schedules.at(i) = schedule;
        (sensor->shouldRun(clockRTC.getDateTime().hour, clockRTC.getDateTime().minute)) ? sensorHandler(sensor, true)
                                                                                        : sensorHandler(sensor, false);
    }
}
void alarmFlow() {
    for (size_t i = 0; i < DEVICE_COUNT; i++) {
        if (!schedules.at(i).getDevice()->isFlow()) {
            continue;
        }
        auto schedule = schedules.at(i);
        auto sensor = schedule.getDevice();
        auto alarm = Alarm.alarmRepeat(sensor->getHourOn(), sensor->getMinuteOn(), sensor->getHourOff(), sensor->getMinuteOff(),
                                       sensorHandler, sensor);
        schedule.setAlarm(alarm);

        schedules.at(i) = schedule;
        (sensor->shouldRun(clockRTC.getDateTime().hour, clockRTC.getDateTime().minute)) ? sensorHandler(sensor, true)
                                                                                        : sensorHandler(sensor, false);
    }
}
void alarmCompressor() {
    for (size_t i = 0; i < DEVICE_COUNT; i++) {
        if (!schedules.at(i).getDevice()->isCompressor()) {
            continue;
        }
        auto schedule = schedules.at(i);
        auto sensor = schedule.getDevice();
        auto alarm = Alarm.alarmRepeat(sensor->getHourOn(), sensor->getMinuteOn(), sensor->getHourOff(), sensor->getMinuteOff(),
                                       sensorHandler, sensor);
        schedule.setAlarm(alarm);

        schedules.at(i) = schedule;
        (sensor->shouldRun(clockRTC.getDateTime().hour, clockRTC.getDateTime().minute)) ? sensorHandler(sensor, true)
                                                                                        : sensorHandler(sensor, false);
    }
}
void alarmCO2() {
    for (size_t i = 0; i < DEVICE_COUNT; i++) {
        if (!schedules.at(i).getDevice()->isCO2()) {
            continue;
        }
        auto schedule = schedules.at(i);

        auto sensor = schedule.getDevice();
        auto alarm = Alarm.alarmRepeat(sensor->getHourOn(), sensor->getMinuteOn(), sensor->getHourOff(), sensor->getMinuteOff(),
                                       sensorHandler, sensor);
        schedule.setAlarm(alarm);

        schedules.at(i) = schedule;
        (sensor->shouldRun(clockRTC.getDateTime().hour, clockRTC.getDateTime().minute)) ? sensorHandler(sensor, true)
                                                                                        : sensorHandler(sensor, false);
    }
}
void alarmDoser() {
    std::unique_ptr<GBasic> emptyDoser{};
    for (size_t i = 0; i < DEVICE_COUNT; i++) {
        if (!schedules.at(i).getDevice()->isDoser()) {
            continue;
        }
        auto schedule = schedules.at(i);
        auto sensor = static_cast<Doser*>(schedule.getDevice());

        emptyDoser = std::make_unique<GBasic>(sensor->getSteps(), sensor->getDirPin(), sensor->getStepPin(), sensor->getEnablePin(),
                                              sensor->getMode0Pin(), sensor->getMode1Pin(), sensor->getMode2Pin(), shiftRegister,
                                              sensor->getIndex());
        auto doserType = sensor->getDoserType();
        if (doserType == Doser::K) {
            doserK = std::move(emptyDoser);
        } else if (doserType == Doser::NP) {
            doserNP = std::move(emptyDoser);
        } else if (doserType == Doser::Fe) {
            doserFe = std::move(emptyDoser);
        } else {
            Serial.printf_P(PSTR("%s"), "Неизвестный тип дозатора");
        }
        auto alarm = Alarm.alarmRepeat(sensor->getHourOn(), sensor->getMinuteOn(), 0, 0, doserOnHandler, sensor);

        // auto alarmOn = Alarm.alarmRepeat(sensor->getHourOn(), sensor->getMinuteOn(), 0, doserOnHandler, sensor);

        schedule.setOn(alarm);
        schedules.at(i) = schedule;
        // TODO Селать проверку на было ли уже событие в текущем дне
        // (sensor->shouldRun(clockRTC.getDateTime().hour, clockRTC.getDateTime().minute)) ? deviceOnHandler(sensor)
        //                                                                                 : deviceOffHandler(sensor);
    }
}
void attachAlarms(Sensor::SensorType sensorType) {
    switch (sensorType) {
        case Sensor::co2:
            alarmCO2();
            break;
        case Sensor::compressor:
            alarmCompressor();
            break;
        case Sensor::flow:
            alarmFlow();
            break;
        case Sensor::heater:
            alarmHeater();
            break;
        case Sensor::light:
            alarmLight();
            break;
        case Sensor::pump:
            alarmPump();
            break;
        case Sensor::doser:
            alarmDoser();
            break;
        case Sensor::sonic:
            alarmSonic();
            break;
        default:
            break;
    }
}

void getParamSonics() {
    char* url = getPGMString(urlSonic);
    Serial.printf_P(PSTR("\n %s\n"), "Дальномеры...");
    https.useHTTP10(true);
    https.getStream().flush();
    if (https.begin(*client, String(url))) {
        int httpCode = https.GET();
        if (httpCode > 0) {
            if (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY) {
                DynamicJsonDocument doc(2000);
                DeserializationError err = deserializeJson(doc, https.getStream());

                if (err) {
                    Serial.printf_P(PSTR(" %s %s\n"), "Ошибка разбора JSON объекта:", err.c_str());
                } else {
                    auto array = doc.as<JsonArray>();
                    for (JsonObject obj : array) {
                        std::string name = obj["name"];  // "аквариум", "второй отсек", "последний отсек", "приемный отсек", ...
                        double critical = obj["critical"];       // 15.4, 17.2, 18.7, 16.9, 14.2
                        bool enabled = obj["enabled"];           // true, true, true, true, true
                        std::string objectId = obj["objectId"];  // "0E4C72F4-AA1D-435A-AF2D-156F2BE2E5C0", ...

